IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
#include "camera_rtos.h"             // Camera RTOS 对外错误码、健康统计和任务入口

#include "camera_cli.h"              // 文本 CLI 处理模式、二值化阈值及 SD SNAPSHOT 命令
#include "camera_dcmi_dma.h"         // DCMI 快照启动、完成标志查询和停止接口
#include "camera_frame_buffer.h"     // front/back 双缓冲提交和稳定 front frame 访问
#include "camera_image_process.h"    // BYPASS、GRAY、BINARY 图像处理及统计
#include "camera_pc_dump.h"          // 文本 DUMP 解析、OV56RGB5 发送和 DCMI back 地址
#include "camera_snapshot_control.h" // SDIO takeover 期间阻止 DUMP/binary request 的软件保护
#include "camera_uart_dispatcher.h"  // 在同一 UART 字节流中区分文本与二进制图像请求
#include "bsp_log.h"                 // IWDG 停止刷新时输出一次故障原因
#include "cmsis_os.h"                // CMSIS-RTOS2 延时、当前任务和栈余量查询接口
#include "stm32f4xx_hal_iwdg.h"      // IWDG 寄存器宏、配置类型和刷新操作
#include "uart_rx_dma.h"             // USART1 RX DMA、StreamBuffer 读取及错误恢复接口

#include <stddef.h>                   // 提供 NULL 和 size_t

//============================================================================
// @file    camera_rtos.c
// @brief   摄像头业务串行执行、UART 请求分发和运行健康监控
//
// 本模块主要负责：
// 1. 在 CameraServiceTask 中读取 USART1 RX DMA 的 StreamBuffer；
// 2. 将同一字节流分发为文本 CLI/DUMP 或 binary image request；
// 3. 串行启动 DCMI 快照，限时等待 ISR 发布“一帧完成”标志；
// 4. 按 back→front→图像处理→再次提交的顺序发布稳定 RGB565 帧；
// 5. 让文本 DUMP、二进制请求和 SD SNAPSHOT 复用同一帧准备路径；
// 6. 在 MonitorTask 中采样任务栈、Heap、心跳并决定是否刷新 IWDG。
//
// 任务上下文关系：当前工程没有独立 CLI Task。CLI 和 SD SNAPSHOT 都由
// CameraServiceTask 解析后同步执行，所以 DCMI/DMA 始终只有一个任务级所有者。
// DCMI 帧事件 ISR 只设置完成标志，不在中断中做图像处理、UART 或 FatFs 操作。
// MonitorTask 不参与摄像头业务，只观察健康状态并独占 IWDG 刷新职责。
//
// 数据关系：DCMI/算法写 back，整帧完成后 commit 为 front；DUMP 读取 front，
// SD SNAPSHOT 先复制 front 到 staging，再进行会占用共享引脚的 SDIO takeover。
//============================================================================

// 每轮最多从 StreamBuffer 取 32 字节：局部数组保持很小，同时逐字节分发的延迟可控。
#define CAMERA_RTOS_UART_RX_CHUNK_SIZE             32U

// 最多等待 UART 数据 100 ms；超时会返回主循环检查半帧超时、更新心跳和栈统计。
// 这既避免无数据时 CPU 空转，也避免永久阻塞后无法观测任务健康。
#define CAMERA_RTOS_UART_READ_TIMEOUT_MS           100U

// 每 1000 ms 采样一次 stack high-water mark，即任务运行以来“曾经最少剩余”的栈字节数。
// 数值越小表示栈峰值越接近上限；它是历史最小值，不是某一瞬间的普通空闲量。
#define CAMERA_RTOS_STACK_SAMPLE_PERIOD_MS         1000U

// 公共 DUMP 路径的来源标签，只用于软件保护和统计分类，不写入任何 UART 协议字段。
#define CAMERA_RTOS_DUMP_SOURCE_TEXT                   0U
#define CAMERA_RTOS_DUMP_SOURCE_BINARY                 1U

// LSI 约 32 kHz 时，(999 + 1)×256/32000 ≈ 8 秒，留出正常图像/SD 操作时间。
#define CAMERA_RTOS_IWDG_PRESCALER                  IWDG_PRESCALER_256
#define CAMERA_RTOS_IWDG_RELOAD                     999U

// CameraServiceTask 最长允许 6 秒没有新心跳，低于约 8 秒硬件复位窗口以留出复位余量。
#define CAMERA_RTOS_IWDG_CAMERA_AGE_LIMIT_MS        6000U

// MonitorTask 正常每 1 秒运行一次，3 秒阈值可容忍短暂调度延迟但能识别真正停滞。
#define CAMERA_RTOS_IWDG_MONITOR_AGE_LIMIT_MS       3000U

// 写入 IWDG 分频/重装值后最多轮询 100 ms，防止寄存器异常时初始化永久忙等。
#define CAMERA_RTOS_IWDG_UPDATE_TIMEOUT_MS          100U

// RVU/PVU 表示重装值或分频值仍在更新；两位都清零后新配置才可安全使用。
#define CAMERA_RTOS_IWDG_UPDATE_FLAGS               (IWDG_SR_RVU | IWDG_SR_PVU)

// 调度器启动前由 Camera_RTOS_Init() 设置；CameraServiceTask 用它接收命令和发送响应。
// 该指针不是 ISR 通信变量，初始化完成后运行期不再切换 UART 实例。
static UART_HandleTypeDef *s_camera_rtos_uart;

// 跨 CameraServiceTask、MonitorTask、STATUS 和 FreeRTOS Hook 共享的诊断状态。
// 各字段为 volatile，但整个结构不是事务快照；它只用于健康监控而不参与业务同步。
static CameraRtosStats_t s_camera_rtos_stats;

// 保存 UART 混合协议解析状态，仅由 CameraServiceTask 初始化、喂入字节和复位。
// ISR 只把字节搬入 StreamBuffer，不直接接触此状态机。
static CameraUartDispatcher_t s_camera_uart_dispatcher;

// OV56RGB5 响应 frame_id，从 1 开始并只在整帧成功发送后递增。
// 它与 binary request 自带的 sequence 是两个不同概念，不能互相替代。
static uint32_t s_camera_rtos_frame_id = 1U;

// IWDG 句柄在调度器启动前配置；运行期只有 MonitorTask 根据全局健康条件刷新。
static IWDG_HandleTypeDef s_camera_rtos_iwdg;

// 在 Camera_RTOS_Init() 中建立干净的诊断基线，不改变 UART、DCMI 或缓冲区状态。
// 字段按协议统计、资源监控、Hook/心跳和 IWDG 四组清零，避免上次运行残值进入 STATUS。
static void Camera_RTOS_ClearStats(void)
{
    // 文本/二进制图像请求共用的 DUMP 结果统计。
    s_camera_rtos_stats.dump_request_count = 0U;
    s_camera_rtos_stats.dump_success_count = 0U;
    s_camera_rtos_stats.dump_error_count = 0U;

    // UART 空闲、文本半行及二进制协议解析分类统计。
    s_camera_rtos_stats.uart_none_count = 0U;
    s_camera_rtos_stats.uart_pending_count = 0U;
    s_camera_rtos_stats.binary_request_count = 0U;
    s_camera_rtos_stats.binary_request_success_count = 0U;
    s_camera_rtos_stats.binary_request_error_count = 0U;
    s_camera_rtos_stats.binary_request_crc_error_count = 0U;
    s_camera_rtos_stats.binary_request_version_error_count = 0U;
    s_camera_rtos_stats.binary_request_type_error_count = 0U;
    s_camera_rtos_stats.binary_request_length_error_count = 0U;
    s_camera_rtos_stats.binary_request_eof_error_count = 0U;
    s_camera_rtos_stats.binary_request_timeout_count = 0U;
    s_camera_rtos_stats.last_binary_request_seq = 0U;
    s_camera_rtos_stats.last_binary_error_code = IMAGE_REQUEST_PARSE_NONE;

    // 最近业务结果、任务运行时间以及栈/Heap 最低余量。
    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_NONE;
    s_camera_rtos_stats.last_dump_time_ms = 0U;
    s_camera_rtos_stats.uptime_ms = 0U;
    s_camera_rtos_stats.camera_service_stack_min_free_bytes = 0U;
    s_camera_rtos_stats.monitor_stack_min_free_bytes = 0U;
    s_camera_rtos_stats.free_heap_bytes = 0U;
    s_camera_rtos_stats.min_ever_free_heap_bytes = 0U;

    // 严重 Hook 和两个任务的心跳由不同上下文更新，启动时统一归零。
    s_camera_rtos_stats.hook_fault_code = 0U;
    s_camera_rtos_stats.hook_fault_count = 0U;
    s_camera_rtos_stats.assert_line = 0U;
    s_camera_rtos_stats.camera_service_heartbeat_count = 0U;
    s_camera_rtos_stats.monitor_heartbeat_count = 0U;
    s_camera_rtos_stats.camera_service_heartbeat_ms = 0U;
    s_camera_rtos_stats.monitor_heartbeat_ms = 0U;
    s_camera_rtos_stats.camera_service_heartbeat_age_ms = 0U;
    s_camera_rtos_stats.monitor_heartbeat_age_ms = 0U;

    // IWDG 尚未初始化，因此先标记为禁用且没有跳过记录。
    s_camera_rtos_stats.iwdg_enabled = 0U;
    s_camera_rtos_stats.iwdg_refresh_skip_count = 0U;
    s_camera_rtos_stats.iwdg_last_skip_reason = CAMERA_RTOS_IWDG_SKIP_NONE;
}

// 为当前未链接 HAL IWDG 源文件的构建提供最小兼容初始化。
// 调用位置仍遵守 HAL 接口：先验证句柄和配置，再启动 IWDG、开放写保护、写入
// 分频/重装寄存器，并等待硬件完成更新。IWDG 一旦启动便只能由复位停止。
HAL_StatusTypeDef HAL_IWDG_Init(IWDG_HandleTypeDef *hiwdg)
{
    uint32_t tick_start;  // 记录寄存器更新轮询起点，用于限定最长等待时间

    // 空句柄、错误实例或超出 HAL 允许范围的参数都不能写入 IWDG 寄存器。
    if ((hiwdg == NULL) || (hiwdg->Instance != IWDG) ||
        (IS_IWDG_PRESCALER(hiwdg->Init.Prescaler) == 0U) ||
        (IS_IWDG_RELOAD(hiwdg->Init.Reload) == 0U))
    {
        return HAL_ERROR;
    }

