IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
    __HAL_IWDG_START(hiwdg);
    IWDG_ENABLE_WRITE_ACCESS(hiwdg);
    hiwdg->Instance->PR = hiwdg->Init.Prescaler;
    hiwdg->Instance->RLR = hiwdg->Init.Reload;

    // RVU/PVU 由硬件在配置同步完成后清零；循环只有“更新完成”或“100 ms 超时”
    // 两个出口。这里尚未启动调度器，不能使用 osDelay，因此采用带超时的短轮询。
    tick_start = HAL_GetTick();
    while ((hiwdg->Instance->SR & CAMERA_RTOS_IWDG_UPDATE_FLAGS) != 0U)
    {
        if ((HAL_GetTick() - tick_start) > CAMERA_RTOS_IWDG_UPDATE_TIMEOUT_MS)
        {
            return HAL_TIMEOUT;
        }
    }

    __HAL_IWDG_RELOAD_COUNTER(hiwdg);
    return HAL_OK;
}

// 为当前构建提供最小 HAL 刷新接口：验证目标确为 IWDG 后写入重装键。
// 本函数不判断系统是否健康；是否允许刷新由 MonitorTask 的 ServiceIwdg() 决定。
HAL_StatusTypeDef HAL_IWDG_Refresh(IWDG_HandleTypeDef *hiwdg)
{
    if ((hiwdg == NULL) || (hiwdg->Instance != IWDG))
    {
        return HAL_ERROR;
    }

    __HAL_IWDG_RELOAD_COUNTER(hiwdg);
    return HAL_OK;
}

// 查询“调用本函数的当前任务”自启动以来历史最小剩余栈空间，单位为字节。
// CMSIS-RTOS2 的该值等价于 stack high-water mark，用于发现最坏时刻的栈压力，
// 因而必须分别在 CameraServiceTask 和 MonitorTask 自己的上下文中调用。
static uint32_t Camera_RTOS_GetCurrentTaskStackMinFreeBytes(void)
{
    return osThreadGetStackSpace(osThreadGetId());
}

// 仅在 CameraServiceTask 上下文采样自身 stack high-water mark。
// 如果改由 MonitorTask 调用，osThreadGetId() 会测到错误的任务，因此保留独立 helper。
static void Camera_RTOS_UpdateCameraServiceStackStats(void)
{
    s_camera_rtos_stats.camera_service_stack_min_free_bytes =
        Camera_RTOS_GetCurrentTaskStackMinFreeBytes();
}

// 在 MonitorTask 上下文同时采样自身历史最小栈余量、当前 Heap 和历史最小 Heap。
// 当前 Heap 反映即时余量，minimum-ever 值则保留系统运行以来最紧张的内存时刻。
static void Camera_RTOS_UpdateMonitorHealthStats(void)
{
    s_camera_rtos_stats.monitor_stack_min_free_bytes =
        Camera_RTOS_GetCurrentTaskStackMinFreeBytes();
    s_camera_rtos_stats.free_heap_bytes = (uint32_t)xPortGetFreeHeapSize();
    s_camera_rtos_stats.min_ever_free_heap_bytes =
        (uint32_t)xPortGetMinimumEverFreeHeapSize();
}

// 使用同一个 current_tick 计算两个任务距离最近一次心跳已经过去多久。
// tick 小于已保存时间时按 0 处理，避免 tick 回退或回绕边界产生无符号巨值并误判超时。
static void Camera_RTOS_UpdateHeartbeatAges(uint32_t current_tick)
{
    s_camera_rtos_stats.camera_service_heartbeat_age_ms =
        (current_tick >= s_camera_rtos_stats.camera_service_heartbeat_ms) ?
        (current_tick - s_camera_rtos_stats.camera_service_heartbeat_ms) : 0U;
    s_camera_rtos_stats.monitor_heartbeat_age_ms =
        (current_tick >= s_camera_rtos_stats.monitor_heartbeat_ms) ?
        (current_tick - s_camera_rtos_stats.monitor_heartbeat_ms) : 0U;
}

// 将 Hook 与两个任务的启动/超时状态按优先顺序归纳为一个 IWDG 跳过原因。
// 该函数只做判定，不直接刷新硬件；统一原因使 STATUS 和故障日志能解释为何不喂狗。
static CameraRtosIwdgSkipReason_t Camera_RTOS_GetIwdgSkipReason(
    uint32_t current_tick)
{
    Camera_RTOS_UpdateHeartbeatAges(current_tick);

    // 严重 Hook 说明内核已进入不可信状态，优先级高于普通任务心跳问题。
    if (s_camera_rtos_stats.hook_fault_code != 0U)
    {
        return CAMERA_RTOS_IWDG_SKIP_HOOK_FAULT;
    }
    // count 为 0 表示任务从未进入主循环，不能把初始时间戳误当成健康心跳。
    if (s_camera_rtos_stats.camera_service_heartbeat_count == 0U)
    {
        return CAMERA_RTOS_IWDG_SKIP_CAMERA_NOT_STARTED;
    }
    if (s_camera_rtos_stats.monitor_heartbeat_count == 0U)
    {
        return CAMERA_RTOS_IWDG_SKIP_MONITOR_NOT_STARTED;
    }
    if (s_camera_rtos_stats.camera_service_heartbeat_age_ms >
        CAMERA_RTOS_IWDG_CAMERA_AGE_LIMIT_MS)
    {
        return CAMERA_RTOS_IWDG_SKIP_CAMERA_TIMEOUT;
    }
    if (s_camera_rtos_stats.monitor_heartbeat_age_ms >
        CAMERA_RTOS_IWDG_MONITOR_AGE_LIMIT_MS)
    {
        return CAMERA_RTOS_IWDG_SKIP_MONITOR_TIMEOUT;
    }

    return CAMERA_RTOS_IWDG_SKIP_NONE;
}

// 仅由 MonitorTask 调用：所有健康条件满足才刷新 IWDG，否则持续停止喂狗等待复位。
// 把刷新职责放在监控任务而不是 CameraServiceTask，可防止摄像头任务卡死后仍自我喂狗。
static void Camera_RTOS_ServiceIwdg(uint32_t current_tick)
{
    CameraRtosIwdgSkipReason_t skip_reason;  // 本周期综合健康判定结果
    uint32_t previous_skip_reason;           // 上周期原因，用于抑制相同错误重复刷屏

    // 初始化失败或尚未启用时没有可刷新的硬件，监控统计仍照常运行。
    if (s_camera_rtos_stats.iwdg_enabled == 0U)
    {
        return;
    }

    skip_reason = Camera_RTOS_GetIwdgSkipReason(current_tick);
    // 只有“两个任务已启动、心跳未超时且无 Hook 故障”才写 IWDG 重装键。
    if (skip_reason == CAMERA_RTOS_IWDG_SKIP_NONE)
    {
        (void)HAL_IWDG_Refresh(&s_camera_rtos_iwdg);
        return;
    }

    previous_skip_reason = s_camera_rtos_stats.iwdg_last_skip_reason;
    s_camera_rtos_stats.iwdg_refresh_skip_count++;
    s_camera_rtos_stats.iwdg_last_skip_reason = (uint32_t)skip_reason;

    // 同一种正式异常只输出一次；后续周期继续累计跳过次数并保持不喂狗，
    // 避免反复日志占用 UART，同时给硬件看门狗留下完成复位的机会。
    if (previous_skip_reason != (uint32_t)skip_reason)
    {
        LOG_ERROR("IWDG refresh skipped, reason=%u", (unsigned int)skip_reason);
    }
}

// 记录一次进入公共图像发送路径的请求；文本 DUMP 和合法二进制请求都会调用。
// 该计数在真正采集前递增，因此也包含随后被 SNAPSHOT guard 阻止的请求。
void Camera_RTOS_RecordDumpRequest(void)
{
    s_camera_rtos_stats.dump_request_count++;
}

// 记录一次“帧准备 + OV56RGB5 发送”完整成功，并保存此次端到端耗时。
// 只在 CameraServiceTask 的公共 DUMP 路径调用，不参与 frame_id 的递增规则。
void Camera_RTOS_RecordDumpSuccess(uint32_t elapsed_ms)
{
    s_camera_rtos_stats.dump_success_count++;
    s_camera_rtos_stats.last_dump_time_ms = elapsed_ms;
}

// 记录一次公共 DUMP 失败；若调用方没有给出具体码，则保存通用 DUMP_FAILED。
// 这样 STATUS 中的失败计数与 last_error_code 不会出现“失败但错误码为 NONE”的矛盾。
void Camera_RTOS_RecordDumpError(uint32_t error_code)
{
    s_camera_rtos_stats.dump_error_count++;
    s_camera_rtos_stats.last_error_code =
        (error_code == CAMERA_RTOS_ERR_NONE) ? CAMERA_RTOS_ERR_DUMP_FAILED : error_code;
}

// 记录 CameraServiceTask 一次限时读取没有收到字节，用于区分正常 UART 空闲与错误恢复。
void Camera_RTOS_RecordUartNone(void)
{
    s_camera_rtos_stats.uart_none_count++;
}

// 记录文本解析器仍处于“命令尚未以 CR/LF 结束”的中间状态，便于观察半行输入。
void Camera_RTOS_RecordUartPending(void)
{
    s_camera_rtos_stats.uart_pending_count++;
}

// 从 FreeRTOS 严重错误 Hook 记录最小故障信息，供 MonitorTask 判定停止刷新 IWDG。
// Hook 触发时调度器或 Heap 可能已经不可靠，因此这里只写静态 volatile 字段，
// 不输出 UART、不等待锁、不分配内存，也不尝试在故障上下文直接恢复业务。
void Camera_RTOS_RecordHookFault(uint32_t fault_code, uint32_t assert_line)
{
    s_camera_rtos_stats.hook_fault_code = fault_code;
    s_camera_rtos_stats.hook_fault_count++;
    s_camera_rtos_stats.assert_line = assert_line;
}

// 在 CameraServiceTask 上下文检查并恢复 UART DMA 错误，ISR 不执行这些复杂操作。
// 返回 0 表示输入链路可继续；返回 1 表示本轮字节已不再可信，主循环必须重新开始。
// 真正重启成功时还会复位两个解析器并排空旧字节，避免错误前后的半帧被拼接。
static uint8_t Camera_RTOS_RecoverUartInputIfNeeded(void)
{
    UartRxDmaRecoveryResult_t recovery_result;  // 无错误、稍后重试或已完成恢复

    recovery_result = UART_RxDma_RecoverIfNeeded();

    // 没有待恢复错误时保留当前协议状态，调用者可以继续处理已有字节。
    if (recovery_result == UART_RX_DMA_RECOVERY_NONE)
    {
        return 0U;
    }

