IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_DMA_RECOVERY;
    // HAL/UART 暂时仍忙时延时 1 ms 让出 CPU，下轮主循环再尝试；不在此忙等。
    if (recovery_result == UART_RX_DMA_RECOVERY_RETRY)
    {
        (void)osDelay(1U);
        return 1U;
    }

    // DMA 已恢复后，恢复前残留的文本行或二进制半帧都必须整体作废。
    CameraUartDispatcher_Reset(&s_camera_uart_dispatcher);
    Camera_PC_Dump_ResetCommandParser();
    (void)UART_RxDma_Drain();
    if (UART_RxDma_HasOverflow() != 0U)
    {
        UART_RxDma_ClearOverflow();
    }
    return 1U;
}

// 处理 ISR 向 StreamBuffer 写入过快造成的溢出；一旦丢字节，当前协议帧便无法可信解析。
// 因此复位文本/二进制状态机、排空现有残片后再清 overflow 标志，而不是尝试续接。
// 返回 1 提醒 CameraServiceTask 放弃当前 chunk，0 表示没有发生溢出。
static uint8_t Camera_RTOS_DiscardOverflowedInput(void)
{
    // 无溢出时不能清解析器，否则每次检查都会破坏正常的跨 chunk 命令/请求。
    if (UART_RxDma_HasOverflow() == 0U)
    {
        return 0U;
    }

    CameraUartDispatcher_Reset(&s_camera_uart_dispatcher);
    Camera_PC_Dump_ResetCommandParser();
    (void)UART_RxDma_Drain();
    UART_RxDma_ClearOverflow();
    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_STREAM_OVERFLOW;
    return 1U;
}

// 在 CameraServiceTask 中同步准备一帧最终可读的 RGB565 front frame。
// 请求交接方式：UART ISR 只把字节送入 StreamBuffer；CameraServiceTask 将字节解析为
// 文本 DUMP、binary image request 或 SD SNAPSHOT CLI 事件后，再直接调用本函数。
// 当前实现没有独立 CLI Task，也没有另一个任务通过 prepare flag 并发控制 DCMI，
// 因而所有摄像头 HAL 操作、超时停止、commit 和图像处理都保持在单一任务上下文。
//
// 处理顺序是：DCMI 写 back → ISR 置完成标志 → 原始帧 commit 为 front →
// 图像算法读该 front、写另一个 back → 再次 commit，最终 front 才交给 DUMP/SD。
// 两条业务链复用这里，是为了避免各自维护不同的采集时序、超时和处理模式规则。
uint32_t Camera_RTOS_PrepareRgb565Frame(uint32_t timeout_ms)
{
    uint8_t snapshot_ret;                      // DCMI 快照启动子错误，0 表示 DMA 已启动
    uint32_t snapshot_start_tick;              // 计算 ISR 完成标志等待时间的起始 tick
    CameraFrameBufferStatus_t commit_ret;      // 将已完成 back 发布为 front 的结果
    CameraImageProcessStatus_t process_ret;    // BYPASS/GRAY/BINARY 处理及第二次提交结果
    CameraProcessMode_t process_mode;          // CLI 当前选择的处理模式，本次准备期间保持该快照值
    uint8_t binary_threshold;                  // BINARY 模式使用的 0~255 灰度阈值快照

    // 零超时无法给 ISR 留出任何完成机会，也会让调用语义不明确，因此按状态错误拒绝。
    if (timeout_ms == 0U)
    {
        return CAMERA_RTOS_ERR_BAD_STATE;
    }

    // snapshot_done 由 DCMI 帧事件 ISR 写 1；启动新快照前必须清零，
    // 否则上一次完成标志可能让本次等待立即通过并发布尚未写完的 back buffer。
    Camera_DCMI_ClearSnapshotDone();

    // Camera_PC_Dump_GetBufferAddress() 实际返回双缓冲当前 back 地址；DCMI DMA 按
    // 32 位 word 把一整帧 RGB565 写入这里。front 在 DMA 期间保持不变，因此消费者
    // 若仍持有 front 视图，也不会读到正在变化的半帧。
    snapshot_ret = Camera_DCMI_StartSnapshotToBuffer(
        Camera_PC_Dump_GetBufferAddress(),
        Camera_PC_Dump_GetWordCount());
    // 启动失败表示 DMA/DCMI 未建立可靠采集状态，必须先停止硬件再向上返回阶段子码。
    if (snapshot_ret != 0U)
    {
        Camera_DCMI_Stop();   // 启动失败也统一停止，清理可能部分配置的采集状态
        // 高位基础码定位“快照启动阶段”，低位保留 DCMI helper 的具体子错误。
        return CAMERA_RTOS_ERR_SNAPSHOT_START_BASE | (uint32_t)snapshot_ret;
    }

    // DCMI ISR 在完整帧事件中置 snapshot_done；任务只轮询这个轻量标志，不在 ISR
    // 做 commit 或图像算法。循环有 timeout_ms 上限，每轮 osDelay(1) 主动让出 CPU，
    // 因此它不是无界忙等待；出口只有“ISR 已完成”或“超时停止 DCMI”。
    snapshot_start_tick = HAL_GetTick();
    while (Camera_DCMI_IsSnapshotDone() == 0U)
    {
        // 使用无符号 tick 差计算等待时长，可自然处理常规 HAL tick 回绕。
        if ((HAL_GetTick() - snapshot_start_tick) > timeout_ms)
        {
            Camera_DCMI_Stop();   // 超时必须停止 DMA/DCMI，不能把未完成 back 发布出去
            return CAMERA_RTOS_ERR_SNAPSHOT_TIMEOUT;
        }
        (void)osDelay(1U);  // 阻塞当前任务 1 ms，让 MonitorTask 和其他就绪任务运行
    }

    // ISR 已确认完整帧到达；先停止采集，确保 DMA 不再写 back，然后才允许交换索引。
    Camera_DCMI_Stop();

    // 第一次 commit 发布 DCMI 原始 RGB565：本次 back 变为稳定 front，旧 front
    // 变成可供图像处理写入的新 back。DUMP/SD 仍不会直接读取正在写的 back。
    commit_ret = Camera_FrameBuffer_CommitBackBuffer();
    if (commit_ret != CAMERA_FB_OK)
    {
        // 高位标识双缓冲发布阶段，低位保留 CameraFrameBufferStatus_t 子错误。
        return CAMERA_RTOS_ERR_CAPTURE_COMMIT_BASE | (uint32_t)commit_ret;
    }

    // 在本次处理开始前读取一次 CLI 配置；BYPASS 也会把原始 front 复制到 back 并
    // 计算统计，使三种模式都遵守“读稳定 front、写 back、成功后 commit”的规则。
    process_mode = Camera_CLI_GetProcessMode();
    binary_threshold = Camera_CLI_GetBinaryThreshold();

    // ApplyToFrameBuffer() 从原始 front 读取，向当前 back 写处理结果；只有算法完整
    // 成功后它才执行第二次 commit。返回成功时，最终 front 就是 DUMP 与 SD 共用帧。
    process_ret = Camera_ImageProcess_ApplyToFrameBuffer(process_mode, binary_threshold);
    if (process_ret != CAMERA_PROCESS_OK)
    {
        // 用户选择的 GRAY/BINARY 等处理失败时，回退到 BYPASS，把稳定原始 front
        // 完整复制到 back 并提交，尽量保留可发送/保存的一帧而不是发布半成品。
        process_ret = Camera_ImageProcess_ApplyToFrameBuffer(
            CAMERA_PROCESS_MODE_BYPASS,
            binary_threshold);
        if (process_ret != CAMERA_PROCESS_OK)
        {
            // 连 BYPASS 都失败说明帧视图、尺寸或提交链路已异常，不能宣称准备成功。
            return CAMERA_RTOS_ERR_IMAGE_PROCESS_BASE | (uint32_t)process_ret;
        }
        // BYPASS 回退成功后最终 front 仍是一帧完整原始 RGB565，允许业务继续。
    }

    return CAMERA_RTOS_ERR_NONE;
}

// 把公共帧准备与 OV56RGB5 发送串成一次完整 DUMP，供文本和二进制请求共同调用。
// 准备成功后 Camera_PC_Dump_SendFrame() 只读取最终 front；它不会读取仍可被下一轮
// DCMI/算法写入的 back。frame_id 仅在完整 UART 帧成功发送后递增，失败时保留原值。
static uint32_t Camera_RTOS_PrepareAndSend(void)
{
    uint8_t dump_ret;          // OV56RGB5 header、payload 或 CRC 发送阶段的子错误
    uint32_t prepare_result;   // DCMI、commit、图像处理公共准备结果

    // 文本 DUMP 与 binary request 使用相同的 3000 ms 采集上限和处理模式。
    prepare_result = Camera_RTOS_PrepareRgb565Frame(
        CAMERA_RTOS_RGB565_PREPARE_TIMEOUT_MS);
    if (prepare_result != CAMERA_RTOS_ERR_NONE)
    {
        return prepare_result;
    }

    // 发送模块从稳定 front 构造 OV56RGB5 header，发送 payload 并附加 CRC32。
    dump_ret = Camera_PC_Dump_SendFrame(
        s_camera_rtos_uart,
        s_camera_rtos_frame_id);
    if (dump_ret != 0U)
    {
        // 高位基础码定位 UART 帧发送阶段，低位保留发送 helper 的具体子错误。
        return CAMERA_RTOS_ERR_DUMP_SEND_BASE | (uint32_t)dump_ret;
    }

    // 只有 header、完整 payload 和 CRC 都发送成功，下一次响应才使用新 frame_id。
    s_camera_rtos_frame_id++;
    return CAMERA_RTOS_ERR_NONE;   // 公共准备和 UART 发送均已完成
}

