IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
// 在 CameraServiceTask 内统一执行文本 DUMP 与 binary image request，并先检查快照保护。
// SD SNAPSHOT takeover 会暂时改变摄像头/SDIO 共享硬件；guard 禁止此时再启动 DCMI，
// 避免两条路径同时驱动 PC8/PC9/PC11。request_source 只决定阻止统计和是否输出文本，
// 成功路径始终复用相同的 PrepareAndSend()，不会形成两套采集/协议实现。
static uint8_t Camera_RTOS_ProcessDumpRequest(uint8_t request_source)
{
#if (CAMERA_SD_DIAG_SD_ONLY_BOOT != 0U)
    static const uint8_t sd_only_text[] =
        "DUMP blocked: SD_ONLY_BOOT_NO_CAMERA.\r\n";
#endif
    static const uint8_t blocked_text[] =
        "DUMP blocked: snapshot software guard active.\r\n";
    uint32_t error_code;       // 公共准备或 OV56RGB5 发送返回的分阶段错误码
    uint32_t dump_start_tick;  // 端到端 DUMP 计时起点
    uint32_t dump_elapsed_ms;  // 包含采集、处理和阻塞式 UART 发送的总耗时

    // 请求一进入公共路径即计数，因此被 SD-only/guard 阻止的请求也可在 STATUS 中观察。
    Camera_RTOS_RecordDumpRequest();

#if (CAMERA_SD_DIAG_SD_ONLY_BOOT != 0U)
    // 历史 SD-only 诊断构建没有可用摄像头链路，任何图像请求都必须被明确阻止。
    if (request_source == CAMERA_RTOS_DUMP_SOURCE_BINARY)
    {
        Camera_SnapshotControl_RecordBinaryBlocked();
    }
    else
    {
        Camera_SnapshotControl_RecordDumpBlocked();
    }

    // 此诊断信息属于文本控制面；构建开关启用时按原行为通过 UART 输出。
    if (s_camera_rtos_uart != NULL)
    {
        (void)HAL_UART_Transmit(
            s_camera_rtos_uart,
            (uint8_t *)sd_only_text,
            (uint16_t)(sizeof(sd_only_text) - 1U),
            HAL_MAX_DELAY);
    }

    s_camera_rtos_stats.last_dump_time_ms = 0U;
    Camera_RTOS_RecordDumpError(CAMERA_RTOS_ERR_SD_ONLY_BOOT_NO_CAMERA);
    return 0U;
#endif

    // guard 为 0 表示 SD SNAPSHOT 已占用或正在切换共享硬件，不能启动新的 DCMI 快照。
    if (Camera_SnapshotControl_IsDumpAllowed() == 0U)
    {
        if (request_source == CAMERA_RTOS_DUMP_SOURCE_BINARY)
        {
            // 二进制请求被阻止时只更新统计，不插入 ASCII 文本，避免破坏 PC 协议同步。
            Camera_SnapshotControl_RecordBinaryBlocked();
        }
        else
        {
            Camera_SnapshotControl_RecordDumpBlocked();
            if (s_camera_rtos_uart != NULL)
            {
                // 文本 DUMP 允许返回可读原因；阻塞发送保持既有控制台输出顺序。
                (void)HAL_UART_Transmit(
                    s_camera_rtos_uart,
                    (uint8_t *)blocked_text,
                    (uint16_t)(sizeof(blocked_text) - 1U),
                    HAL_MAX_DELAY);
            }
        }

        s_camera_rtos_stats.last_dump_time_ms = 0U;
        Camera_RTOS_RecordDumpError(CAMERA_RTOS_ERR_SNAPSHOT_GUARD_ACTIVE);
        return 0U;
    }

    // 计时覆盖 DCMI 等待、图像处理及 UART 整帧发送，用于 STATUS 的 last_dump_time_ms。
    dump_start_tick = HAL_GetTick();
    error_code = Camera_RTOS_PrepareAndSend();
    dump_elapsed_ms = HAL_GetTick() - dump_start_tick;
    Camera_RTOS_UpdateCameraServiceStackStats();
    if (error_code == CAMERA_RTOS_ERR_NONE)
    {
        Camera_RTOS_RecordDumpSuccess(dump_elapsed_ms);
        return 1U;
    }

    s_camera_rtos_stats.last_dump_time_ms = dump_elapsed_ms;
    Camera_RTOS_RecordDumpError(error_code);
    return 0U;
}

// 记录已通过 dispatcher 完整校验的 binary image request。
// request->seq 是 PC 请求序号，仅用于关联和诊断，不改变 OV56RGB5 响应 frame_id。
static void Camera_RTOS_RecordBinaryRequest(
    const ImageRequestFrame_t *request)
{
    s_camera_rtos_stats.binary_request_count++;
    s_camera_rtos_stats.last_binary_request_seq = request->seq;
}

// 记录一次 binary request 解析失败，并把总数拆分到 CRC、版本、类型、长度或 EOF。
// 该函数只消费 dispatcher 已给出的结果，不在这里重新解析字节，也不发送文本响应。
static void Camera_RTOS_RecordBinaryError(
    ImageRequestParseResult_t parse_result)
{
    s_camera_rtos_stats.binary_request_error_count++;
    s_camera_rtos_stats.last_binary_error_code = (uint32_t)parse_result;

    // switch 只为已定义的协议错误增加分类计数；其他结果仍保留在总错误和 last code 中。
    switch (parse_result)
    {
        case IMAGE_REQUEST_PARSE_CRC_ERROR:
            s_camera_rtos_stats.binary_request_crc_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_VERSION_ERROR:
            s_camera_rtos_stats.binary_request_version_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_TYPE_ERROR:
            s_camera_rtos_stats.binary_request_type_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_LENGTH_ERROR:
            s_camera_rtos_stats.binary_request_length_error_count++;
            break;

        case IMAGE_REQUEST_PARSE_EOF_ERROR:
            s_camera_rtos_stats.binary_request_eof_error_count++;
            break;

        default:
            break;
    }
}

// 记录 binary request 在规定时间内未收齐的半帧超时。
// 不输出 ASCII 错误文本，防止 PC 正在等待二进制响应时被额外字节打乱帧边界。
static void Camera_RTOS_RecordBinaryTimeout(void)
{
    s_camera_rtos_stats.binary_request_timeout_count++;
    s_camera_rtos_stats.last_binary_error_code = IMAGE_REQUEST_PARSE_TIMEOUT;
}

// 将 dispatcher 判定为文本的单字节交给现有行解析器，并把其返回事件映射到业务。
// 本函数运行在 CameraServiceTask；普通 CLI 由 FeedCommandByte() 内部同步处理，
// DUMP 则只返回事件后在这里进入公共采集路径，因此不存在另一个并发 CLI Task。
static void Camera_RTOS_ProcessTextByte(uint8_t byte)
{
    uint8_t command;  // 文本行仍未结束、已由 CLI 处理、DUMP 或异常状态

    command = Camera_PC_Dump_FeedCommandByte(s_camera_rtos_uart, byte);
    // PENDING 表示当前字节尚未形成完整行，保留解析器状态等待后续 CR/LF。
    if (command == CAMERA_PC_DUMP_CMD_PENDING)
    {
        Camera_RTOS_RecordUartPending();
        return;
    }

    // HELP/STATUS/PROC/THR/RESET/SD 等 CLI 已在文本行解析器内部同步完成。
    if (command == CAMERA_PC_DUMP_CMD_CLI)
    {
        return;
    }

    // DUMP 事件不能只输出文本，需在本任务上下文执行采集、处理和 OV56RGB5 发送。
    if (command == CAMERA_PC_DUMP_CMD_DUMP)
    {
        (void)Camera_RTOS_ProcessDumpRequest(CAMERA_RTOS_DUMP_SOURCE_TEXT);
        return;
    }

    s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_BAD_STATE;
}

// 将混合协议 dispatcher 的单个结果转换为文本处理、图像请求或错误统计动作。
// event 由同一任务刚调用的 dispatcher 填充，生命周期只覆盖当前处理步骤；本函数
// 不保存其地址。NONE/default 不做业务，BAD_ARGUMENT 记为内部状态错误。
static void Camera_RTOS_ProcessDispatchEvent(
    CameraUartDispatchResult_t result,
    const CameraUartDispatchEvent_t *event)
{
    // 每个输入字节最多产生一个事件；二进制请求只有完整通过协议校验后才进入 DUMP。
    switch (result)
    {
        case CAMERA_UART_DISPATCH_TEXT_BYTE:
            Camera_RTOS_ProcessTextByte(event->text_byte);
            break;

