IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
        case CAMERA_UART_DISPATCH_IMAGE_REQUEST:
            Camera_RTOS_RecordBinaryRequest(&event->image_request);
            // 成功计数只在共用的帧准备和 OV56RGB5 发送全部成功后递增。
            if (Camera_RTOS_ProcessDumpRequest(
                    CAMERA_RTOS_DUMP_SOURCE_BINARY) != 0U)
            {
                s_camera_rtos_stats.binary_request_success_count++;
            }
            break;

        case CAMERA_UART_DISPATCH_BINARY_ERROR:
            Camera_RTOS_RecordBinaryError(event->binary_result);
            break;

        case CAMERA_UART_DISPATCH_BINARY_TIMEOUT:
            Camera_RTOS_RecordBinaryTimeout();
            break;

        case CAMERA_UART_DISPATCH_BAD_ARGUMENT:
            s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_BAD_STATE;
            break;

        case CAMERA_UART_DISPATCH_NONE:
        default:
            break;
    }
}

// 在调度器启动前重置模块状态并登记 UART；不创建任务，也不启动 DMA/DCMI。
// 先暂存 NULL 可保证无效参数路径不会遗留旧句柄，frame_id 每次系统初始化从 1 开始。
void Camera_RTOS_Init(UART_HandleTypeDef *huart)
{
    s_camera_rtos_uart = NULL;
    s_camera_rtos_frame_id = 1U;
    Camera_RTOS_ClearStats();

    // 无效句柄只记录错误；CameraServiceTask 启动后会每秒阻塞重试等待有效配置。
    if (huart == NULL)
    {
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_NULL;
        return;
    }

    s_camera_rtos_uart = huart;
}

// 在调度器启动前按约 8 秒窗口配置并启动 IWDG，运行期刷新权只交给 MonitorTask。
// 只有 HAL 初始化成功才设置 enabled；失败时 MonitorTask 仍运行健康统计但不会假喂狗。
HAL_StatusTypeDef Camera_RTOS_IwdgInit(void)
{
    HAL_StatusTypeDef status;  // 保存最小 HAL 初始化的成功、参数错误或更新超时结果

    s_camera_rtos_iwdg.Instance = IWDG;
    s_camera_rtos_iwdg.Init.Prescaler = CAMERA_RTOS_IWDG_PRESCALER;
    s_camera_rtos_iwdg.Init.Reload = CAMERA_RTOS_IWDG_RELOAD;

    status = HAL_IWDG_Init(&s_camera_rtos_iwdg);
    if (status == HAL_OK)
    {
        s_camera_rtos_stats.iwdg_enabled = 1U;
    }

    return status;
}

// CameraServiceTask 主循环：独占 UART 协议状态机和摄像头业务级控制。
// UART ISR/DMA 只负责接收并把字节送入 StreamBuffer；本任务分块取出后逐字节区分
// 文本与二进制协议。普通 CLI、DUMP 和 SD SNAPSHOT 都在这里串行执行，因此 CLI
// 不会从另一个任务同时启动 DCMI。循环还周期更新心跳与 stack high-water mark。
void Camera_RTOS_CameraServiceTask(void *argument)
{
    uint8_t rx_chunk[CAMERA_RTOS_UART_RX_CHUNK_SIZE];    // 栈上 32 字节接收块，不存放大图像
    size_t received;                                     // 本轮从 StreamBuffer 实际取出的字节数，最大 32
    size_t i;                                            // 在当前有限 rx_chunk 内逐字节喂解析器的索引
    uint32_t stack_sample_tick;                          // 上次采样 high-water mark 的 HAL tick
    uint32_t current_tick;                               // 同一轮周期判断使用的当前 HAL tick 快照
    CameraUartDispatchEvent_t dispatch_event;            // dispatcher 输出的文本字节、请求或错误详情
    CameraUartDispatchResult_t dispatch_result;          // 说明本次输入是否形成一个可处理事件

    (void)argument;  // CubeMX 任务入口保留统一参数，本任务当前不需要启动参数

    // 两级解析状态都由本任务拥有：dispatcher 先区分文本/二进制，PC Dump parser
    // 再把文本累计为 CR/LF 结尾的命令行。任务启动时先清除任何旧半帧状态。
    CameraUartDispatcher_Init(&s_camera_uart_dispatcher);
    Camera_PC_Dump_ResetCommandParser();

    // UART 句柄必须由调度器启动前的 Camera_RTOS_Init() 提供。循环在句柄有效时退出；
    // 配置缺失时没有总 timeout，因为任务无法继续其唯一业务，但每轮 osDelay(1000)
    // 都会阻塞让出 CPU，因此不是忙等待，MonitorTask 仍可运行并最终由健康机制处理。
    while (s_camera_rtos_uart == NULL)
    {
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_NULL;
        (void)osDelay(1000U);
    }

    // 启动 USART1 RX DMA 和静态 StreamBuffer。循环在 HAL_OK 时退出；暂时失败时每秒
    // 重试一次且主动阻塞，不会高速反复操作硬件。这里保持原有无总 timeout 策略，
    // 因为没有接收链路时 CameraServiceTask 无法进入正常协议主循环。
    while (UART_RxDma_Init(s_camera_rtos_uart) != HAL_OK)
    {
        s_camera_rtos_stats.last_error_code = CAMERA_RTOS_ERR_UART_DMA_INIT;
        (void)osDelay(1000U);
    }

    // 初始化完成后先建立一次栈余量基线；以后每约 1 秒更新历史最小剩余字节数。
    Camera_RTOS_UpdateCameraServiceStackStats();
    stack_sample_tick = HAL_GetTick();

    // 任务生命周期主循环没有“退出”条件，这是 FreeRTOS 服务任务的正常模型。
    // 每轮要么在 UART_RxDma_Read() 最多阻塞 100 ms，要么处理至多 32 字节；
    // 错误重试也包含 osDelay，因此该无限循环不会在空闲状态持续占满 CPU。
    for (;;)
    {
        // 心跳在每轮入口更新。若后续 DUMP、SD 或 UART 路径异常阻塞超过 6 秒，
        // MonitorTask 会看到年龄超限并停止刷新 IWDG，而不是让本任务自行掩盖卡死。
        s_camera_rtos_stats.camera_service_heartbeat_count++;
        s_camera_rtos_stats.camera_service_heartbeat_ms = HAL_GetTick();

        // 先处理 UART 硬件错误；返回非零表示解析连续性已失效，本轮不能继续用旧 chunk。
        if (Camera_RTOS_RecoverUartInputIfNeeded() != 0U)
        {
            continue;  // 重新进入主循环，由恢复后的 DMA/解析器接收新数据
        }

        // StreamBuffer 丢字节后 magic、length、CRC 或文本行边界都可能错位，必须整体丢弃。
        if (Camera_RTOS_DiscardOverflowedInput() != 0U)
        {
            continue;
        }

        // 从 ISR/DMA 后端的 StreamBuffer 进行“有上限的阻塞读取”：最多取满 32 字节，
        // 最长等待 100 ms。小块降低任务栈占用，也让协议超时和健康采样定期得到执行。
        received = UART_RxDma_Read(rx_chunk,
                                   sizeof(rx_chunk),
                                   CAMERA_RTOS_UART_READ_TIMEOUT_MS);
        if (received == 0U)
        {
            // 等待期间 ISR 仍可能报告 DMA 错误或 StreamBuffer 溢出，因此在把 received=0
            // 当作普通空闲前再检查一次；有错误便清状态并立即开始下一轮。
            if ((Camera_RTOS_RecoverUartInputIfNeeded() != 0U) ||
                (Camera_RTOS_DiscardOverflowedInput() != 0U))
            {
                continue;
            }
            // 无新字节时让 dispatcher 检查 binary request 半帧是否已超时；若超时，
            // 它会产生一次事件以复位协议状态，避免残缺请求永久占住解析器。
            dispatch_result = CameraUartDispatcher_CheckTimeout(
                &s_camera_uart_dispatcher,
                HAL_GetTick(),
                &dispatch_event);
            // NONE 不做业务，TIMEOUT 则只更新二进制超时统计而不插入文本响应。
            Camera_RTOS_ProcessDispatchEvent(dispatch_result, &dispatch_event);

            // 该计数描述正常空闲/超时唤醒频率，并不等价于 UART 错误次数。
            Camera_RTOS_RecordUartNone();

            // 即使 UART 一直空闲也每秒采样 high-water mark，便于 STATUS 观察最坏栈余量。
            current_tick = HAL_GetTick();
            if ((current_tick - stack_sample_tick) >=
                CAMERA_RTOS_STACK_SAMPLE_PERIOD_MS)
            {
                Camera_RTOS_UpdateCameraServiceStackStats();
                stack_sample_tick = current_tick;
            }
            continue;  // 本轮没有业务字节，回到带超时读取而不是空转
        }

        // rx_chunk 长度由 UART_RxDma_Read() 和 32 字节数组共同限制；循环按顺序逐字节
        // 喂入有状态 dispatcher，received 个字节处理完即退出，不存在无界扫描。
        for (i = 0U; i < received; ++i)
        {
            // 解析 chunk 期间 DMA 仍在后台接收；若此时发生错误/溢出，当前块剩余字节
            // 与解析器状态可能已不连续，因此立即 break 丢弃，而不是继续拼接坏帧。
            if ((Camera_RTOS_RecoverUartInputIfNeeded() != 0U) ||
                (Camera_RTOS_DiscardOverflowedInput() != 0U))
            {
                break;  // 退出有限字节循环，下轮从已复位的接收链路重新同步
            }

            // dispatcher 用当前 tick 维护二进制半帧 timeout，并输出至多一个业务事件。
            dispatch_result = CameraUartDispatcher_FeedByte(
                &s_camera_uart_dispatcher,
                rx_chunk[i],
                HAL_GetTick(),
                &dispatch_event);
            // 文本字节、完整二进制请求、解析错误等都在同一任务中立即串行处理。
            Camera_RTOS_ProcessDispatchEvent(dispatch_result, &dispatch_event);
        }

