IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_rtos.c
        // 有持续 UART 流量时不会进入 received=0 分支，因此在 chunk 处理后重复同一周期采样。
        current_tick = HAL_GetTick();
        if ((current_tick - stack_sample_tick) >=
            CAMERA_RTOS_STACK_SAMPLE_PERIOD_MS)
        {
            Camera_RTOS_UpdateCameraServiceStackStats();
            stack_sample_tick = current_tick;
        }
    }
}

// MonitorTask 主循环：以 1000 ms 周期观察系统健康并独占 IWDG 刷新决策。
// 它不处理 UART 或图像，以免监控路径与 OV56RGB5 字节流、DCMI 状态产生资源竞争。
void Camera_RTOS_MonitorTask(void *argument)
{
    uint32_t current_tick;  // 本周期心跳、年龄判定和 IWDG 服务共用的 tick 快照

    (void)argument;  // CubeMX 任务入口保留统一参数，监控任务当前不需要启动参数

    // 监控任务与系统同生命周期，因此循环不退出；每轮首先 osDelay(1000) 阻塞，
    // 不会形成空转。延时返回后依次更新时间、心跳、资源余量和 IWDG 决策。
    for (;;)
    {
        (void)osDelay(1000U);
        s_camera_rtos_stats.uptime_ms += 1000U;

        // 先发布 MonitorTask 自身心跳，再用同一 tick 计算两个任务的年龄。
        s_camera_rtos_stats.monitor_heartbeat_count++;
        current_tick = HAL_GetTick();
        s_camera_rtos_stats.monitor_heartbeat_ms = current_tick;
        Camera_RTOS_UpdateMonitorHealthStats();
        Camera_RTOS_ServiceIwdg(current_tick);
    }
}

// 返回内部统计结构的只读视图，主要供 STATUS 命令读取缓存健康信息。
// 调用时只刷新心跳年龄，不主动操作 UART、DCMI、SDIO 或 FatFs，因此 STATUS 保持只读。
// 结构不会整体复制或加锁，各 volatile 字段可能来自相邻监控周期，适合诊断而非业务同步。
const CameraRtosStats_t *Camera_RTOS_GetStats(void)
{
    uint32_t current_tick = HAL_GetTick();  // 两个心跳年龄使用同一时间基准

    // 读取 STATUS 前即时更新年龄；tick 异常回退时 helper 按 0 处理，避免无符号下溢。
    Camera_RTOS_UpdateHeartbeatAges(current_tick);

    return &s_camera_rtos_stats;
}
